# St7SetTransientBaseExcitation

Sets the type of base excitation for linear and nonlinear transient dynamic analysis.

long St7SetTransientBaseExcitation(long uID, long BaseType)

Input Parameters

uID

Strand7 model file ID.

BaseType

One of beNone, beAcceleration, beVelocity or beDisplacement.